tap "go-to-k/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Tool for glamorous shell scripts
brew "gum"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Cross-shell prompt for astronauts
brew "starship"
# delstack
brew "go-to-k/tap/delstack"
# Application launcher and productivity software
cask "alfred"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
vscode "42Crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andys8.jest-snippets"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "Arjun.swagger-viewer"
vscode "bmalehorn.vscode-fish"
vscode "casualjim.gotemplate"
vscode "cshum.convert-newline-list-to-array"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "EliverLara.andromeda"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "estivo.csv-editor"
vscode "folke.vscode-monorepo-workspace"
vscode "foxundermoon.shell-format"
vscode "franckdervaux.nicegaugetables"
vscode "fredwangwang.vscode-hcl-format"
vscode "getgauge.gauge"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "ionutvmi.spacegray-vscode"
vscode "jmMeessen.jenkins-declarative-support"
vscode "joshuapoehls.json-escaper"
vscode "kddejong.vscode-cfn-lint"
vscode "mermade.openapi-lint"
vscode "mindaro-dev.file-downloader"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vscode.vscode-typescript-tslint-plugin"
vscode "ms-vsliveshare.vsliveshare"
vscode "NicolasVuillamy.vscode-groovy-lint"
vscode "numso.prettier-standard-vscode"
vscode "Orta.vscode-jest"
vscode "pcsoftware.readable"
vscode "Prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sadeghpm.sql-snippets"
vscode "skyapps.fish-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "swyphcosmo.spellchecker"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "WallabyJs.quokka-vscode"
vscode "wholroyd.jinja"
