tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "paldepind/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Colorize logfiles and command output
brew "grc"
# Tool for glamorous shell scripts
brew "gum"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Rust toolchain installer
brew "rustup"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Cross-shell prompt for astronauts
brew "starship"
# Blazingly fast terminal recorder that generates animated gif images for the web
brew "t-rec"
# Internet file retriever
brew "wget"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Voice and text chat software
cask "discord"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Control your tools with a few keystrokes
cask "raycast"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "adpyke.vscode-sql-formatter"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andrejunges.handlebars"
vscode "andys8.jest-snippets"
vscode "be5invis.toml"
vscode "be5invis.vscode-custom-css"
vscode "casualjim.gotemplate"
vscode "catppuccin.catppuccin-vsc"
vscode "dandric.vscode-jq"
vscode "dotjoshjohnson.xml"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "equinusocio.moxer-icons"
vscode "equinusocio.moxer-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "estivo.csv-editor"
vscode "folke.vscode-monorepo-workspace"
vscode "foxundermoon.shell-format"
vscode "franckdervaux.nicegaugetables"
vscode "fredwangwang.vscode-hcl-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ionutvmi.spacegray-vscode"
vscode "itsmeadarsh.vsc-handlebars-ext"
vscode "joshbolduc.commitlint"
vscode "joshuapoehls.json-escaper"
vscode "kddejong.vscode-cfn-lint"
vscode "mindaro-dev.file-downloader"
vscode "mkhl.direnv"
vscode "mohsen1.prettify-json"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "numso.prettier-standard-vscode"
vscode "orta.vscode-jest"
vscode "philosowaffle.openapi-designer"
vscode "prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "richie5um2.vscode-sort-json"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sadeghpm.sql-snippets"
vscode "skyapps.fish-vscode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "swyphcosmo.spellchecker"
vscode "tal7aouy.theme"
vscode "theholycoder.swagger-tools"
vscode "timonwong.shellcheck"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "zoellner.openapi-preview"
