tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Colorize logfiles and command output
brew "grc"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Cross-shell prompt for astronauts
brew "starship"
# Internet file retriever
brew "wget"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
vscode "42crunch.vscode-openapi"
vscode "adpyke.vscode-sql-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andys8.jest-snippets"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arjun.swagger-viewer"
vscode "casualjim.gotemplate"
vscode "cshum.convert-newline-list-to-array"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "estivo.csv-editor"
vscode "folke.vscode-monorepo-workspace"
vscode "foxundermoon.shell-format"
vscode "franckdervaux.nicegaugetables"
vscode "fredwangwang.vscode-hcl-format"
vscode "getgauge.gauge"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ionutvmi.spacegray-vscode"
vscode "jmmeessen.jenkins-declarative-support"
vscode "joshuapoehls.json-escaper"
vscode "kddejong.vscode-cfn-lint"
vscode "mermade.openapi-lint"
vscode "mindaro-dev.file-downloader"
vscode "mohsen1.prettify-json"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "numso.prettier-standard-vscode"
vscode "orta.vscode-jest"
vscode "pcsoftware.readable"
vscode "prisma.prisma"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sadeghpm.sql-snippets"
vscode "skyapps.fish-vscode"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "swyphcosmo.spellchecker"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "wholroyd.jinja"
