Arjun.swagger-viewer
casualjim.gotemplate
DotJoshJohnson.xml
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
eriklynd.json-tools
esbenp.prettier-vscode
foxundermoon.shell-format
franckdervaux.nicegaugetables
getgauge.gauge
golang.go
himanoa.Python-autopep8
jebbs.plantuml
jmMeessen.jenkins-declarative-support
joshuapoehls.json-escaper
kddejong.vscode-cfn-lint
maty.vscode-mocha-sidebar
mermade.openapi-lint
mohsen1.prettify-json
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode.vscode-typescript-next
ms-vscode.vscode-typescript-tslint-plugin
ms-vsliveshare.vsliveshare
NicolasVuillamy.vscode-groovy-lint
Orta.vscode-jest
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
ryanluker.vscode-coverage-gutters
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
timonwong.shellcheck
wholroyd.jinja
