arcticicestudio.nord-visual-studio-code
Arjun.swagger-viewer
casualjim.gotemplate
DotJoshJohnson.xml
eamodio.gitlens
EditorConfig.EditorConfig
enkia.tokyo-night
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
eriklynd.json-tools
esbenp.prettier-vscode
estivo.csv-editor
foxundermoon.shell-format
franckdervaux.nicegaugetables
fredwangwang.vscode-hcl-format
getgauge.gauge
golang.go
GrapeCity.gc-excelviewer
hashicorp.terraform
ionutvmi.spacegray-vscode
jmMeessen.jenkins-declarative-support
joshuapoehls.json-escaper
kddejong.vscode-cfn-lint
mermade.openapi-lint
mindaro-dev.file-downloader
mohsen1.prettify-json
ms-azuretools.vscode-docker
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode.vscode-typescript-next
ms-vscode.vscode-typescript-tslint-plugin
ms-vsliveshare.vsliveshare
NicolasVuillamy.vscode-groovy-lint
numso.prettier-standard-vscode
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
richie5um2.vscode-sort-json
ryanluker.vscode-coverage-gutters
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
swyphcosmo.spellchecker
teabyii.ayu
timonwong.shellcheck
wholroyd.jinja
